## staging: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                     |
|--------|----------------------------------------------|
| add    | `github_actions_secret.manifests_account_id` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.manifests_account_id will be created
  + resource "github_actions_secret" "manifests_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "STAGING_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
